[
  {
    "id": "japanese-conversation-bot",
    "title": "Japanese Conversation Bot",
    "technologies": "Django, JavaScript, Docker",
    "featured": true,
    "og": "/japanese-conversation-bot.png",
    "body": "This is a project that I worked on when OpenAI API first became publicly available. The aim of the project is to have a Japanese tutor who can converse with the user in Japanese, correct the user's errors, and encourage the user to become more proficient in speaking Japanese as they converse with the chatbot.\r\n\r\n## Overview\r\n\r\nThe ideal flow of the project is: user presses the \"speak\" button and speaks in Japanese -> Whisper transcribes text, transcribed text appears in the text area, users may manually correct any mistakes by typing -> submit user message -> user message sent to OpenAI API, the API returns a response -> response as a piece of text is displayed on the web app -> response as a piece of text is sent to VoiceVox, which performs text to speech.\r\n\r\n![](/japanese-conversation-bot/flowchart.png)\r\n\r\nThis project uses Flask and HTML, Tailwind CSS, JavaScript.\r\n\r\n## Capture User Audio\r\n\r\nA `POST` request is sent from my web app's root route to `/transcribe`. In there, I captured a blob of audio, saved it, and sent it to Whisper via `openai`, a Python wrapper of the OpenAI API.\r\n\r\n```python\r\nblob = request.files['blob'].read()\r\nwith open('blob.wav', 'wb') as f:\r\n    f.write(blob)\r\naudio_file = open('blob.wav', \"rb\")\r\nopenai.api_key = config.OPENAI_API_KEY\r\ntranscript = openai.Audio.transcribe(\"whisper-1\", audio_file)[\"text\"]\r\nreturn jsonify({'output': transcript})\r\n```\r\n\r\n## Choosing good Text to Speech API\r\n\r\nI have actually compared different TTS options available to me.\r\n\r\nSpeechCloud API was too expensive, it was priced at around 0.01 Euro per word/character. Coqui seems doable, but currently stuck with some character parsing issues. Voicevox proves to be very useful. I downloaded it locally, which also started a local at the same time. I wrote a script that performs audio query and synthesizes the query into an audio file. I was also able to parse the returned JSON from get_speakers() method to have a clearer manual on speaker selection.\r\n\r\n## VoiceVox in Docker\r\n\r\nAt the beginning, I made use of VoiceVox by actually downloading the software and opening it locally. To make it simpler for the user, I used the following code snippet to run a Docker container version of the VoiceVox server.\r\n\r\n```python\r\nimport docker\r\n\r\nclient = docker.from_env()\r\n\r\n# Pull the Docker image\r\nclient.images.pull('voicevox/voicevox_engine:cpu-ubuntu20.04-latest')\r\n\r\n# Run the Docker container\r\ncontainer = client.containers.run(\r\n    'voicevox/voicevox_engine:cpu-ubuntu20.04-latest',\r\n    detach=True,\r\n    ports={'50021/tcp': ('127.0.0.1', 50021)},\r\n    remove=True,\r\n    tty=True\r\n)\r\n\r\n# Print the container logs\r\nprint(container.logs(follow=True))\r\n```\r\n\r\nAlso, stop the Docker container that contains the VoiceVox image on exit using the atexit library.\r\n\r\n```python\r\ndef OnExitApp():\r\n    tts.stop_voicevox()\r\n\r\natexit.register(OnExitApp)\r\n```\r\n\r\n## UI\r\n\r\nThe UI looks like this:\r\n\r\n![](/japanese-conversation-bot.png)\r\n\r\nBefore that, I have also made a prototype using Gradio.\r\n\r\n![](/japanese-conversation-bot/gradio.png)\r\n\r\n## Closing Notes\r\n\r\nGoing further, I may be able to improve the UI, incorporate more features such as displaying Furigana, bookmarking good conversations, and so on. Overall, it was very fun working on this project. I got to practice a lot about how to leverage existing solutions to build something that I wish existed."
  },
  {
    "id": "interactive-math-web-app",
    "title": "Interative Math Web App",
    "technologies": "Next.js, React.js, MongoDB",
    "featured": true,
    "og": "/math-webapp.png",
    "body": "\r\nThis is a math web app that allows you to do math calculations in the browser. It supports basic arithmetic operations, such as addition, subtraction, multiplication, and division. You can also perform more advanced operations, such as exponentiation, square roots, and trigonometric functions.\r\n\r\n# Features\r\n\r\n- Basic arithmetic operations\r\n- Advanced math functions\r\n- Interactive graphing\r\n- Customizable settings\r\n- Save and load calculations\r\n\r\n# Technologies Used\r\n\r\n- HTML\r\n- CSS\r\n- JavaScript\r\n- Math.js\r\n- Chart.js\r\n- LocalStorage\r\n\r\n# Implementations\r\n\r\n```javascript\r\nfunction add(a, b) {\r\n  return a + b;\r\n}\r\n\r\nfunction subtract(a, b) {\r\n  return a - b;\r\n}\r\n```\r\n\r\n## h2\r\n\r\n### h3\r\n"
  }
]